{"word2idx": {"<pad>": 0, "<start>": 1, "<end>": 2, "<unk>": 3, "a": 4, "small": 5, "dog": 6, "sitting": 7, "on": 8, "couch": 9, "puppy": 10, "standing": 11, "white": 12, "background": 13, "running": 14, "through": 15, "field": 16, "of": 17, "grass": 18, "cat": 19, "in": 20, "cardboard": 21, "box": 22, "laying": 23, "purple": 24, "blanket": 25, "group": 26, "dogs": 27, "three": 28, "french": 29, "bulldogs": 30, "looking": 31, "over": 32, "fence": 33, "two": 34, "porch": 35, "out": 36, "the": 37, "window": 38, "bulldog": 39, "pup": 40, "for": 41, "sale": 42, "black": 43, "sidewalk": 44, "with": 45, "its": 46, "tongue": 47, "basket": 48, "bicycle": 49, "red": 50, "carpet": 51, "next": 52, "to": 53, "car": 54, "ground": 55, "bowl": 56, "food": 57, "and": 58, "woman": 59, "kneeling": 60, "down": 61, "pet": 62, "cartoon": 63, "horse": 64, "pink": 65, "nose": 66, "are": 67, "held": 68, "persons": 69, "hand": 70, "american": 71, "pitterr": 72, "by": 73, "david": 74, "l": 75, "smith": 76, "is": 77, "walking": 78, "leash": 79, "dirt": 80, "covered": 81, "german": 82, "shepherd": 83, "chihuahua": 84, "stock": 85, "photo": 86, "image": 87, "bed": 88, "brown": 89, "sheet": 90, "pomeranians": 91, "words": 92, "spitz": 93, "tech": 94, "daly": 95, "under": 96, "tree": 97, "man": 98, "his": 99, "lap": 100, "fluffy": 101, "rug": 102, "top": 103, "pile": 104, "straw": 105, "painting": 106, "snow": 107, "cement": 108, "surface": 109, "table": 110, "leather": 111, "chair": 112, "holding": 113, "hinds": 114, "head": 115, "playing": 116, "yellow": 117, "rubber": 118, "duck": 119, "baby": 120, "floor": 121, "labs": 122, "kitten": 123, "plastic": 124, "bag": 125, "tan": 126, "daypore": 127, "miniature": 128, "her": 129, "across": 130, "lush": 131, "green": 132, "collar": 133, "up": 134, "mouth": 135, "open": 136, "ball": 137, "trash": 138, "hill": 139, "wooden": 140, "deck": 141, "woods": 142, "tiled": 143, "poodle": 144, "bench": 145, "road": 146, "toy": 147, "doberman": 148, "rider": 149, "race": 150, "around": 151, "track": 152, "pen": 153, "donkeys": 154, "horses": 155, "gravel": 156, "person": 157, "riding": 158, "arena": 159, "grazing": 160, "fenced": 161, "area": 162, "people": 163, "stream": 164, "front": 165, "brick": 166, "building": 167, "wearing": 168, "harness": 169, "stable": 170, "mother": 171, "foa": 172, "foas": 173, "eating": 174, "pony": 175, "trees": 176, "sandy": 177, "beach": 178, "bre": 179, "being": 180, "fed": 181, "leading": 182, "sky": 183, "side": 184, "river": 185, "muddy": 186, "desert": 187, "jockey": 188, "back": 189, "tall": 190, "forest": 191, "wall": 192, "an": 193, "galloing": 194, "jumping": 195, "saddle": 196, "behind": 197, "street": 198, "coat": 199, "it": 200, "other": 201, "elephants": 202, "near": 203, "elephant": 204, "adult": 205, "middle": 206, "fog": 207, "wild": 208, "cloudy": 209, "big": 210, "eye": 211, "very": 212, "long": 213, "trunk": 214, "rock": 215, "zoo": 216, "sunset": 217, "some": 218, "leaves": 219, "bush": 220, "water": 221, "herd": 222, "body": 223, "each": 224, "grassy": 225, "dust": 226, "mud": 227, "at": 228, "watering": 229, "hole": 230, "dry": 231, "crossing": 232, "plain": 233, "one": 234, "zebras": 235, "log": 236, "leaf": 237, "chola": 238, "national": 239, "park": 240, "botswana": 241, "africa": 242, "large": 243, "spraying": 244, "tusky": 245, "stand": 246, "silhouetted": 247, "against": 248, "rhino": 249, "tuffly": 250, "brush": 251, "maso": 252, "game": 253, "reserve": 254, "wilderness": 255, "feeding": 256, "jungle": 257, "petting": 258, "close": 259, "dress": 260, "tusks": 261, "facing": 262, "shade": 263, "city": 264, "flower": 265, "butterfly": 266, "blue": 267, "blade": 268, "plant": 269, "butterflies": 270, "moth": 271, "wings": 272, "spots": 273, "monarch": 274, "colorful": 275, "many": 276, "colors": 277, "tor": 278, "piece": 279, "paper": 280, "flying": 281, "wing": 282, "striped": 283, "flowers": 284, "perched": 285, "branch": 286, "orange": 287, "sun": 288, "bat": 289, "hanging": 290, "dark": 291, "chicken": 292, "comb": 293, "chickens": 294, "yard": 295, "hay": 296, "bird": 297, "spread": 298, "rooster": 299, "air": 300, "cage": 301, "coop": 302, "birds": 303, "hens": 304, "tail": 305, "bucket": 306, "quote": 307, "dirty": 308, "room": 309, "couple": 310, "logo": 311, "kittens": 312, "eyes": 313, "gray": 314, "sad": 315, "look": 316, "face": 317, "camera": 318, "framed": 319, "print": 320, "staring": 321, "concrete": 322, "drawn": 323, "ledge": 324, "hair": 325, "that": 326, "saysim": 327, "drawing": 328, "ya": 329, "sticking": 330, "yaking": 331, "tag": 332, "neck": 333, "computer": 334, "bow": 335, "paws": 336, "pillow": 337, "little": 338, "girl": 339, "painted": 340, "yas": 341, "caption": 342, "says": 343, "did": 344, "you": 345, "know": 346, "something": 347, "hiding": 348, "cattle": 349, "cow": 350, "cows": 351, "barn": 352, "ribbon": 353, "calf": 354, "children": 355, "mountains": 356, "frame": 357, "pasture": 358, "lake": 359, "pig": 360, "shape": 361, "house": 362, "mountain": 363, "bull": 364, "sand": 365, "sign": 366, "sheep": 367, "lamb": 368, "bighorn": 369, "ram": 370, "stands": 371, "edge": 372, "grand": 373, "canyon": 374, "barbed": 375, "stick": 376, "flock": 377, "goat": 378, "rams": 379, "lambs": 380, "young": 381, "boy": 382, "arms": 383, "horns": 384, "bighorns": 385, "rocks": 386, "cliff": 387, "looks": 388, "from": 389, "sheeps": 390, "seen": 391, "town": 392, "gorin": 393, "hillside": 394, "ocean": 395, "rocky": 396, "goats": 397, "spider": 398, "web": 399, "sits": 400, "garden": 401, "crawling": 402, "rose": 403, "tara": 404, "widow": 405, "wasp": 406, "spiders": 407, "legs": 408, "droplets": 409, "crab": 410, "monkey": 411, "abdomen": 412, "orb": 413, "sculpture": 414, "skull": 415, "wood": 416, "insect": 417, "same": 418, "squirrel": 419, "fruit": 420, "fall": 421, "banana": 422, "nuts": 423, "groundhogs": 424, "pose": 425, "groundhog": 426, "climbing": 427, "animal": 428, "carrot": 429, "post": 430, "nut": 431, "chip": 432, "moss": 433, "drinking": 434, "puddle": 435, "stump": 436, "pine": 437, "rabbit": 438, "christmas": 439, "peeking": 440, "rodent": 441, "bear": 442, "jar": 443, "peanut": 444, "butter": 445, "bread": 446, "hamy": 447}, "idx2word": {"0": "<pad>", "1": "<start>", "2": "<end>", "3": "<unk>", "4": "a", "5": "small", "6": "dog", "7": "sitting", "8": "on", "9": "couch", "10": "puppy", "11": "standing", "12": "white", "13": "background", "14": "running", "15": "through", "16": "field", "17": "of", "18": "grass", "19": "cat", "20": "in", "21": "cardboard", "22": "box", "23": "laying", "24": "purple", "25": "blanket", "26": "group", "27": "dogs", "28": "three", "29": "french", "30": "bulldogs", "31": "looking", "32": "over", "33": "fence", "34": "two", "35": "porch", "36": "out", "37": "the", "38": "window", "39": "bulldog", "40": "pup", "41": "for", "42": "sale", "43": "black", "44": "sidewalk", "45": "with", "46": "its", "47": "tongue", "48": "basket", "49": "bicycle", "50": "red", "51": "carpet", "52": "next", "53": "to", "54": "car", "55": "ground", "56": "bowl", "57": "food", "58": "and", "59": "woman", "60": "kneeling", "61": "down", "62": "pet", "63": "cartoon", "64": "horse", "65": "pink", "66": "nose", "67": "are", "68": "held", "69": "persons", "70": "hand", "71": "american", "72": "pitterr", "73": "by", "74": "david", "75": "l", "76": "smith", "77": "is", "78": "walking", "79": "leash", "80": "dirt", "81": "covered", "82": "german", "83": "shepherd", "84": "chihuahua", "85": "stock", "86": "photo", "87": "image", "88": "bed", "89": "brown", "90": "sheet", "91": "pomeranians", "92": "words", "93": "spitz", "94": "tech", "95": "daly", "96": "under", "97": "tree", "98": "man", "99": "his", "100": "lap", "101": "fluffy", "102": "rug", "103": "top", "104": "pile", "105": "straw", "106": "painting", "107": "snow", "108": "cement", "109": "surface", "110": "table", "111": "leather", "112": "chair", "113": "holding", "114": "hinds", "115": "head", "116": "playing", "117": "yellow", "118": "rubber", "119": "duck", "120": "baby", "121": "floor", "122": "labs", "123": "kitten", "124": "plastic", "125": "bag", "126": "tan", "127": "daypore", "128": "miniature", "129": "her", "130": "across", "131": "lush", "132": "green", "133": "collar", "134": "up", "135": "mouth", "136": "open", "137": "ball", "138": "trash", "139": "hill", "140": "wooden", "141": "deck", "142": "woods", "143": "tiled", "144": "poodle", "145": "bench", "146": "road", "147": "toy", "148": "doberman", "149": "rider", "150": "race", "151": "around", "152": "track", "153": "pen", "154": "donkeys", "155": "horses", "156": "gravel", "157": "person", "158": "riding", "159": "arena", "160": "grazing", "161": "fenced", "162": "area", "163": "people", "164": "stream", "165": "front", "166": "brick", "167": "building", "168": "wearing", "169": "harness", "170": "stable", "171": "mother", "172": "foa", "173": "foas", "174": "eating", "175": "pony", "176": "trees", "177": "sandy", "178": "beach", "179": "bre", "180": "being", "181": "fed", "182": "leading", "183": "sky", "184": "side", "185": "river", "186": "muddy", "187": "desert", "188": "jockey", "189": "back", "190": "tall", "191": "forest", "192": "wall", "193": "an", "194": "galloing", "195": "jumping", "196": "saddle", "197": "behind", "198": "street", "199": "coat", "200": "it", "201": "other", "202": "elephants", "203": "near", "204": "elephant", "205": "adult", "206": "middle", "207": "fog", "208": "wild", "209": "cloudy", "210": "big", "211": "eye", "212": "very", "213": "long", "214": "trunk", "215": "rock", "216": "zoo", "217": "sunset", "218": "some", "219": "leaves", "220": "bush", "221": "water", "222": "herd", "223": "body", "224": "each", "225": "grassy", "226": "dust", "227": "mud", "228": "at", "229": "watering", "230": "hole", "231": "dry", "232": "crossing", "233": "plain", "234": "one", "235": "zebras", "236": "log", "237": "leaf", "238": "chola", "239": "national", "240": "park", "241": "botswana", "242": "africa", "243": "large", "244": "spraying", "245": "tusky", "246": "stand", "247": "silhouetted", "248": "against", "249": "rhino", "250": "tuffly", "251": "brush", "252": "maso", "253": "game", "254": "reserve", "255": "wilderness", "256": "feeding", "257": "jungle", "258": "petting", "259": "close", "260": "dress", "261": "tusks", "262": "facing", "263": "shade", "264": "city", "265": "flower", "266": "butterfly", "267": "blue", "268": "blade", "269": "plant", "270": "butterflies", "271": "moth", "272": "wings", "273": "spots", "274": "monarch", "275": "colorful", "276": "many", "277": "colors", "278": "tor", "279": "piece", "280": "paper", "281": "flying", "282": "wing", "283": "striped", "284": "flowers", "285": "perched", "286": "branch", "287": "orange", "288": "sun", "289": "bat", "290": "hanging", "291": "dark", "292": "chicken", "293": "comb", "294": "chickens", "295": "yard", "296": "hay", "297": "bird", "298": "spread", "299": "rooster", "300": "air", "301": "cage", "302": "coop", "303": "birds", "304": "hens", "305": "tail", "306": "bucket", "307": "quote", "308": "dirty", "309": "room", "310": "couple", "311": "logo", "312": "kittens", "313": "eyes", "314": "gray", "315": "sad", "316": "look", "317": "face", "318": "camera", "319": "framed", "320": "print", "321": "staring", "322": "concrete", "323": "drawn", "324": "ledge", "325": "hair", "326": "that", "327": "saysim", "328": "drawing", "329": "ya", "330": "sticking", "331": "yaking", "332": "tag", "333": "neck", "334": "computer", "335": "bow", "336": "paws", "337": "pillow", "338": "little", "339": "girl", "340": "painted", "341": "yas", "342": "caption", "343": "says", "344": "did", "345": "you", "346": "know", "347": "something", "348": "hiding", "349": "cattle", "350": "cow", "351": "cows", "352": "barn", "353": "ribbon", "354": "calf", "355": "children", "356": "mountains", "357": "frame", "358": "pasture", "359": "lake", "360": "pig", "361": "shape", "362": "house", "363": "mountain", "364": "bull", "365": "sand", "366": "sign", "367": "sheep", "368": "lamb", "369": "bighorn", "370": "ram", "371": "stands", "372": "edge", "373": "grand", "374": "canyon", "375": "barbed", "376": "stick", "377": "flock", "378": "goat", "379": "rams", "380": "lambs", "381": "young", "382": "boy", "383": "arms", "384": "horns", "385": "bighorns", "386": "rocks", "387": "cliff", "388": "looks", "389": "from", "390": "sheeps", "391": "seen", "392": "town", "393": "gorin", "394": "hillside", "395": "ocean", "396": "rocky", "397": "goats", "398": "spider", "399": "web", "400": "sits", "401": "garden", "402": "crawling", "403": "rose", "404": "tara", "405": "widow", "406": "wasp", "407": "spiders", "408": "legs", "409": "droplets", "410": "crab", "411": "monkey", "412": "abdomen", "413": "orb", "414": "sculpture", "415": "skull", "416": "wood", "417": "insect", "418": "same", "419": "squirrel", "420": "fruit", "421": "fall", "422": "banana", "423": "nuts", "424": "groundhogs", "425": "pose", "426": "groundhog", "427": "climbing", "428": "animal", "429": "carrot", "430": "post", "431": "nut", "432": "chip", "433": "moss", "434": "drinking", "435": "puddle", "436": "stump", "437": "pine", "438": "rabbit", "439": "christmas", "440": "peeking", "441": "rodent", "442": "bear", "443": "jar", "444": "peanut", "445": "butter", "446": "bread", "447": "hamy"}}